app/controllers/home_controller.rb

  def index
    flash.discard
    if logged_in?
      if current_user.profile.nil?
        render :template => "users/profile"
      elsif current_user.products.empty?
---
SELECT * FROM `products` WHERE (`products`.user_id = 1) ORDER BY products.id DESC LIMIT 1
SELECT * FROM `profiles` WHERE (`profiles`.user_id = 1) LIMIT 1
SELECT count(*) AS count_all FROM `products` WHERE (`products`.user_id = 1)

  def analytics
    @today = Date.today-1.day
    if request.post?
      @page = params[:page].to_i
    else
      @page = 1
    end
    @size = 5
    @per_page = 1
    @post_pages = (@size.to_f/@per_page).ceil;
    @page =1 if @page.to_i<=0 or @page.to_i > @post_pages
    @titleX = "Time Period"
    @titleY = "#"
    @colors = []
    @i = 0
    @head_line = ""

    case @page
      when @i+=1
        @head_line = "Look at your cool analytics!"
        @title = "# Of Visits"
        @offers_a = Offer.first(:select => "SUM(counter) as total", :joins => "INNER JOIN products ON offers.product_id=products.id and products.user_id = #{current_user.id} and response NOT LIKE 'expired'")
---
SELECT SUM(counter) as total FROM `offers` INNER JOIN products ON offers.product_id=products.id and products.user_id = 1 and response NOT LIKE 'expired' and Date(offers.updated_at) = '2012-08-08' LIMIT 1

  def say_your_price
    if logged_in?
      redirect_to root_path
      return
    end
    if request.post?
      @page = params[:page].to_i
    else
      @page = 1
    end
    category = params[:category]
    @size = Product.all(:conditions => ["category=?", category]).count.to_i
---
SELECT * FROM `products` WHERE (category='1') LIMIT 0,1

  def winners
    @payments = Payment.all(:order => "id desc",:include => [:offer], :limit => 100)
---
SELECT * FROM `payments` ORDER BY id desc LIMIT 100