app/controllers/products_controller.rb

  def new
    if request.post?
      @product = Product.new(params[:product])
      if @product.valid? and @product.errors.empty?
        @product.user = current_user
        @product.quantity = params[:product][:quantity].gsub(/\D+/, "") if params[:product][:quantity]
        @product.regular_price = params[:product][:regular_price].gsub(/\D+/, "")
        @product.target_price = params[:product][:target_price].gsub(/\D+/, "")
        if @product.save
---
INSERT INTO `products` (`description`, `image`, `created_at`, `category`, `user_id`, `target_price`, `quantity`, `updated_at`, `name`, `regular_price`, `is_live`) VALUES('The Hampton Bay Glendale 52 in. Ceiling Fan features an oil-rubbed bronze finish and 5 reversible dark teak/walnut blades for a handsome transitional look that complements a variety of home decor. The 3-light kit comes with light amber glass and uses three 13-watt CFL bulbs, included. The fan offers 3-speed reversible control so you can easily control the speed and airflow, and the multi-capacitor provides quiet operation.\r\n\r\n\r\n5 reversible dark teak/walnut blades allow you to change your decor style without replacing the entire unit\r\n3-light kit with light amber glass\r\n3-speed reversible control\r\nOil-rubbed bronze finish for a transitional style\r\nDesigned for interior use\r\nUses three 13-watt CFL bulbs, included\r\nMulti-capacitor offers quiet operation\r\nUp to 5,450 CFM airflow\r\nLarge room: room size up to 20 ft. x 20 ft.\r\nUL listed\r\nMFG Brand Name : Hampton Bay\r\nMFG Model # : AG524-ORB\r\nMFG Part # : AG524-ORB', '9ee836b1-c5bc-43fa-9403-4643d54da6a1_300.jpg', '2012-08-08 07:34:23', 1, 1, 49.0, NULL, '2012-08-08 07:34:23', 'Hampton Bay Glendale 52 in. Oil Rubbed Bronze Ceiling Fan', 70.0, 1)

  def show
    if params[:id]
      @product = Product.find_by_id(params[:id])
---
SELECT * FROM `products` WHERE (`products`.`id` = '1') LIMIT 1