app/controllers/users_controller.rb

SELECT `users`.id FROM `users` WHERE (LOWER(`users`.`email`) = BINARY 'brijesh@gmail.com') LIMIT 1
---
  def biz
    if logged_in?
      redirect_to root_path
      return
    end
    if params[:user]
      logout_keeping_session!
      @user = User.authenticate(params[:user][:email], params[:user][:password])
      if @user
        @user.update_attribute(:is_blocked, false)
        session[@user.email] = nil

        self.current_user = @user
        new_cookie_flag = (params[:remember_me] == "1")
        handle_remember_cookie! new_cookie_flag
        redirect_back_or_default('/')
        flash[:notice] = nil
      else
        @new_user = User.find_by_email(params[:user][:email])

INSERT INTO `users` (`remember_token`, `created_at`, `email`, `remember_token_expires_at`, `updated_at`, `password`, `is_blocked`) VALUES(NULL, '2012-08-08 06:54:40', 'biz@dealkat.com', NULL, '2012-08-08 06:54:40', 'princessthecat', 0)
---

          success = @user && @user.valid?
          if success && @user.errors.empty?
            @user.save

SELECT * FROM `profiles` WHERE (`profiles`.user_id = 1) LIMIT 1
INSERT INTO `profiles` (`created_at`, `email`, `facebook_url`, `user_id`, `header_color`, `updated_at`, `phone`, `twitter`, `logo_url`, `home_page_image1`, `home_page_image2`, `home_page_image3`, `name`, `address`, `company_url`) VALUES('2012-08-08 07:07:25', 'p.reservations@perrysouthbeachhotel.com', 'http://facebook.com/dealkat', 1, 'FFFFFF', '2012-08-08 07:07:25', '4153233506', 'dealkat', 'mylogo.jpg', '01ba4e87-219f-445d-b10e-02b3fb8b5b5f_300.jpg', 'image1.jpg', '4509ffed-f8b4-42aa-8217-1edb3bb90cd2_300.jpg', 'Dealkat', '82 Pioneer Way', 'http://www.dealkat.com')
---
  def profile
    @profile = current_user.profile if current_user.profile
    if request.post?
      @profile = (current_user.profile || Profile.new(params[:profile]))
      @profile.attributes = params[:profile]
      if @profile.errors.empty? and @profile.valid?
        # header color: 415F9B
        @profile.user = current_user
        @profile.save